openfoam/OpenFOAM-dev/tutorials/incompressibleFluid/waveSubSurface/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.4e-4;

boundaryField
{
    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    "(top|inlet|outlet)"
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
